start = """
👋 <b>Привіт {name}!</b> 

<b>Якщо у тебе статична IP адреса цей бот допоможе відстежувати стан електроенергії \
за допомогою пінгу твого роутера</b>

Бот перевірятиме доступність твого роутера в інтернеті та надсилатиме повідомлення при зміні статусу. \
На жаль, це не буде працювати з динамічною адресою

<b>Щоб почати відстеження надішли команду</b>
/subscribe [твоя IP адреса]
"""

help_ = """
<b>• /subscribe - Підписатися на повідомлення</b>
Для цієї команди потрібно надіслати через пробіл ip-адресу, ось так: /subscribe 192.168.0.1

<b>• /unsubscribe - Припинити повідомлення</b>
Ip адреса перестане відстежуватися, та повідомлення припиняться
"""

subscribe_help = """
ℹ️️ Використання: /subscribe [ip]
"""

ip_regex_error = """
⚠️ Помилка! Переконайтеся, що введено коректну IP-адресу
"""

subscribe_success = """
<b>Ви успішно підписалися на оновлення {ip}</b>
"""

electricity_active = """
✅ Підключено, світло є
"""

electricity_active_time = """
✅ Світло є\n⏱ Відключення тривало {time}
"""

electricity_inactive = """
❌ Роутер не відповідає
"""

unsubscribe_error = """
⚠️ Ви не підписані на повідомлення
"""

unsubscribe_success = """
ℹ️️ Ви відмовилися від усіх повідомлень
"""

stat = """
⚙️ <b>Статистика</b>:

• Усього користувачів: {users}
• Відстежують: {active_users}
"""

logs_error = """
Файл із логами порожній
"""